app/controllers/categorias_controller.rb

SELECT `categorias`.* FROM `categorias`
---
  def index
    @categorias = Categoria.all

SELECT "categorias".* FROM "categorias" WHERE "categorias"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @categoria = Categoria.find(params[:id])

SELECT "categorias".* FROM "categorias" WHERE "categorias"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @categoria = Categoria.find(params[:id])

INSERT INTO "categoria" ("created_at", "nome", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 31 Aug 2013 07:58:32 UTC +00:00], ["nome", "categora 2"], ["updated_at", Sat, 31 Aug 2013 07:58:32 UTC +00:00]]
---
  def create
    @categoria = Categoria.new(params[:categoria])

    respond_to do |format|
      if @categoria.save

SELECT "categorias".* FROM "categorias" WHERE "categorias"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "categorias" SET "nome" = 'maria 2', "updated_at" = '2013-08-31 08:15:14.441032' WHERE "categorias"."id" = 1
---
  def update
    @categoria = Categoria.find(params[:id])

    respond_to do |format|
      if @categoria.update_attributes(params[:categoria])

SELECT "categorias".* FROM "categorias" WHERE "categorias"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "categorias" WHERE "categorias"."id" = ?  [["id", 3]]
---
  def destroy
    @categoria = Categoria.find(params[:id])
    @categoria.destroy