app/controllers/empresas_controller.rb

  def index
    if session["user_tipo"] == 1
      @empresas = Empresa.all
    else
      @empresas = Empresa.where(user_id: session["user_id"])
---
SELECT `empresas`.* FROM `empresas`
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 2

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save
---
INSERT INTO `empresas` (`cnpj`, `created_at`, `email`, `login`, `nome`, `password_digest`, `updated_at`, `user_id`) VALUES ('cnpj 1', '2013-09-02 03:57:43', 'empresa1@user.com', 'empresa1', 'empresa user 1', '$2a$10$H.LZjQEtWeBVSIVQ07m.NugVqG.xVtdJGEFcfcS86LOtJK7Gaufne', '2013-09-02 03:57:43', 2)

  def update
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @empresa = Empresa.find(params[:id])
    @empresa.destroy
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 4 LIMIT 1
DELETE FROM `empresas` WHERE `empresas`.`id` = 4