app/controllers/exames_controller.rb

SELECT `empresas`.* FROM `empresas` ORDER BY nome
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 2 ORDER BY nome
SELECT `categorias`.* FROM `categorias` ORDER BY nome
---
  def index
    if params[:categoria]
      @exames = Exame.order('nome').where(categoria_id: params[:categoria][:categoria_id])
    else
      @exames = []
    end


    if params[:empresa]
      @exames = Exame.where(empresa_id: params[:empresa][:empresa_id])
    else
      @exames = []
    end


    if session[:empresa_id]
      @funcionarios = Funcionario.order('nome').where(empresa_id: session[:empresa_id])
      @empresas = Empresa.order('nome').where(id: session[:empresa_id])
      @empresa = true
    else
      if session[:user]
        if session[:user_tipo] == 1
          @empresas = Empresa.order('nome').all
        else
          @empresas = Empresa.order('nome').where(user_id: session[:user_id])
        end
      end
    end

    @categorias = Categoria.order('nome').all

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 2 ORDER BY nome
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 2 LIMIT 1
---
  def busca
    @por_categoria = []
    @por_empresa = []
    @por_inicio = []
    @por_funcionarios = []

    if session[:user]
      @empresas_ids = Empresa.where(:user_id => session[:user_id])
      @ids_empresas = []
      @empresas_ids.each do |emp|

SELECT `exames`.* FROM `exames` WHERE `exames`.`funcionario_id` IN (1, 2, 3, 4)
---
      @funcionarios_ids.each do |func|
        @ids << func.id
      end
    @por_funcionarios = Exame.where(:funcionario_id => @ids, :empresa_id => @empresas_ids)

SELECT `exames`.* FROM `exames` WHERE (exames.empresa_id = '2' and exames.categoria_id = '1' and (date(exames.created_at) BETWEEN '25-08-2013' AND '07-09-2013'))
SELECT `exames`.* FROM `exames` WHERE `exames`.`empresa_id` IN (6, 7, 8) AND (`exames`.`created_at` >= '2013-08-26 03:00:00' AND `exames`.`created_at` < '2013-09-10 03:00:00')
---
    if params[:busca][:categoria_id].present?


      @por_categoria =  Exame.where(categoria_id: params[:busca][:categoria_id],empresa_id: @ids_empresas)
    end

    if params[:busca][:empresa_id].present?
      @por_empresa =  Exame.where(empresa_id: params[:busca][:empresa_id])

SELECT `exames`.* FROM `exames` WHERE (`exames`.`created_at` >= '2013-09-02 03:00:00' AND `exames`.`created_at` < '2013-09-04 03:00:00')
---
           @por_inicio =  Exame.where(:empresa_id => params[:busca][:empresa_id],:created_at => Time.parse(params[:busca][:data_inicio])...Time.parse(params[:busca][:data_fim]))
        else
          if session[:user_tipo] == 1
            @por_inicio =  Exame.where(:created_at => Time.parse(params[:busca][:data_inicio])...Time.parse(params[:busca][:data_fim]))

SELECT "categorias".* FROM "categorias" ORDER BY nome
---
      end
    end

    @categorias = Categoria.all

SELECT "exames".* FROM "exames" WHERE "exames"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @exame = Exame.find(params[:id])

SELECT `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`empresa_id` = 1 ORDER BY nome
SELECT `empresas`.* FROM `empresas` ORDER BY nome
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 2 ORDER BY nome
SELECT `categorias`.* FROM `categorias`
---
  def new
    @exame = Exame.new

    if session[:empresa_id]
      @funcionarios = Funcionario.order('nome').where(empresa_id: session[:empresa_id])
      @empresas = Empresa.order('nome').where(id: session[:empresa_id])
      @empresa = true
    else
      if session[:user]
        if session[:user_tipo] == 1
          @empresas = Empresa.order('nome').all
        else
          @empresas = Empresa.order('nome').where(user_id: session[:user_id])
        end
      end

      @funcionarios = []
    end

     @categorias = Categoria.all

INSERT INTO "exames" ("categoria_id", "created_at", "funcionario_id", "link", "updated_at") VALUES (?, ?, ?, ?, ?)  [["categoria_id", 1], ["created_at", Sat, 31 Aug 2013 06:44:13 UTC +00:00], ["funcionario_id", 1], ["link", "http:dasda.com"], ["updated_at", Sat, 31 Aug 2013 06:44:13 UTC +00:00]]
---
  def create
    post = Exame.save(params[:exame][:link],params[:exame][:funcionario_id])

SELECT "exames".* FROM "exames" WHERE "exames"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "exames" WHERE "exames"."id" = ?  [["id", 5]]
---
  def destroy
    @exame = Exame.find(params[:id])
    @exame.destroy