app/controllers/exames_controller.rb

  def index
    if params[:categoria]
      @exames = Exame.where(categoria_id: params[:categoria][:categoria_id])
---
SELECT "categoria".* FROM "categoria" WHERE "categoria"."id" = 2 LIMIT 1
SELECT "exames".* FROM "exames" WHERE "exames"."categoria_id" = 0