app/controllers/funcionarios_controller.rb

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`empresa_id` = 1
SELECT `funcionarios`.* FROM `funcionarios`
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 2
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 6 ORDER BY `empresas`.`id` DESC LIMIT 1
SELECT `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`empresa_id` = 1
---
  def index
    # @funcionarios = Funcionario.all
    if session[:user]
      if session[:user_tipo] == 1
        @empresas = Empresa.all
        @funcionarios = Funcionario.all
      else
        @empresas = Empresa.where(user_id: session[:user_id])
        @funcionarios = []
      end
    end

    if session[:empresa_id]
      @empresa = Empresa.where(id: session[:empresa_id]).first
      @funcionarios = Funcionario.where(empresa_id: session[:empresa_id])

SELECT `empresas`.* FROM `empresas`
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 2
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
SELECT `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`empresa_id` = 1
---
  def busca

    if session[:user]
      if session[:user_tipo] == 1
        @empresas = Empresa.all
        @funcionarios = Funcionario.all
      else
        @empresas = Empresa.where(user_id: session[:user_id])
      end
    end

    if session[:empresa_id]
      @empresa = Empresa.where(id: session[:empresa_id]).first
      @funcionarios = Funcionario.where(empresa_id: session[:empresa_id])

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @funcionario = Funcionario.find(params[:id])

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` IS NULL
---
  def new
    @funcionario = Funcionario.new
    @empresas = Empresa.where(:user_id => session["user_id"])

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", "1"]]
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 5
---
  def edit
    @funcionario = Funcionario.find(params[:id])
    @empresas = Empresa.where(:user_id => session["user_id"])

INSERT INTO "funcionarios" ("created_at", "empresa_id", "nome", "rg", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 31 Aug 2013 02:57:17 UTC +00:00], ["empresa_id", 1], ["nome", "funcionario 1"], ["rg", "11111"], ["updated_at", Sat, 31 Aug 2013 02:57:17 UTC +00:00]]
---
  def create
    @funcionario = Funcionario.new(params[:funcionario])

    respond_to do |format|
      if @funcionario.save

SELECT `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`id` = 9 LIMIT 1
UPDATE `funcionarios` SET `nome` = 'func 4 clinica 1', `updated_at` = '2013-09-08 23:41:39' WHERE `funcionarios`.`id` = 9
---
  def update
    @funcionario = Funcionario.find(params[:id])

    respond_to do |format|
      if @funcionario.update_attributes(params[:funcionario])