app/controllers/javascripts_controller.rb

SELECT `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`empresa_id` = 2 ORDER BY nome
---
	def funcionarios_dinamicos
		@funcionarios = Funcionario.where(empresa_id: params[:empresa_id]).order("nome")