app/controllers/page_controller.rb

SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `empresas`
SELECT COUNT(*) FROM `funcionarios`
SELECT COUNT(*) FROM `exames`
SELECT COUNT(*) FROM `empresas` WHERE `empresas`.`user_id` = 2
SELECT COUNT(*) FROM `funcionarios` WHERE `funcionarios`.`empresa_id` = 1
SELECT COUNT(*) FROM `exames` WHERE `exames`.`empresa_id` = 6
SELECT COUNT(*) FROM `categorias`
---
  def index
  	if session[:user]
      if session[:user_tipo]  == 1
        @usuarios = User.count
        @empresas = Empresa.count
        @funcionarios = Funcionario.count
        @exames = Exame.count
      elsif session[:user_tipo] == 2
        @empresas = Empresa.where(user_id: session[:user_id]).count
      else
      end
  	end

    if session[:empresa_id]
      @funcionarios = Funcionario.where(:empresa_id => session[:empresa_id]).count
      @exames = Exame.where(:empresa_id => session[:empresa_id]).count
    end

    @categorias = Categoria.count