app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
	def create
		if params[:session][:login] == "" or params[:session][:password] == ""
			redirect_to new_sessions_path, :notice => "Preencha os dados corretamente."
		else

			@session = Session.new(params[:session])
			if @session.valid?
				@user = User.login(@session.login, @session.password)
				if @user
					if @user.status == 1
						session[:user_id]	= @user.id
						session[:user_nome] = @user.nome
						session[:user_tipo] = @user.tipo
						session[:user_link] = @user.link
						session[:user]		= true
						session[:logado]	= true
						redirect_to session[:requested_url] || root_path
					elsif @user.status == 0
						redirect_to new_sessions_path, :notice => "Sua conta foi desabilitada, procure um administrador."
					else
						redirect_to new_sessions_path, :notice => "Falha no sistema, procure um administrador."
					end

				else
					@empresa = Empresa.login(@session.login, @session.password)
					if @empresa
						@link = User.where(id: @empresa.user_id).first