app/controllers/users_controller.rb

  def create

    #if params[:user][:link]
     #  post = User.save(params[:user][:link])
    #else
     # post = 'ans.png'
    #end


    @user = User.new(params[:user])
    #@user = User.new(link: post, email: params[:user][:email], login: params[:user][:login], nome: params[:user][:nome], password: params[:user][:password], password_confirmation: params[:user][:password_confirmation], tipo: params[:user][:tipo])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `link`, `login`, `nome`, `password_digest`, `tipo`, `updated_at`) VALUES ('2013-09-07 02:02:43', 'sadsaçlk', '20130906230243logomarca.png', 'roger', 'satecn', '$2a$10$/6uLG8KrrzVtSF8NfOxD4Ok.bWmeq.rJEdgnuTNo9o1u2kGbeFgfa', 2, '2013-09-07 02:02:43')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$h/FPRtLDB.eTnLgAgiMX1eGpsd3Vn5xPBQfOCz/VL80/px.DTSMqu', `updated_at` = '2013-09-02 00:27:17' WHERE `users`.`id` = 2

  def desabilitar
    User.where(:id => params[:id]).update_all(:status => 0)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `status` = 0 WHERE `users`.`id` = 1

  def habilitar
    User.where(:id => params[:id]).update_all(:status => 1)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `status` = 1 WHERE `users`.`id` = 1