app/views/exames/_form.html.erb

SELECT `funcionarios`.* FROM `funcionarios` WHERE `funcionarios`.`empresa_id` = 1 ORDER BY nome
---

$("#exame_empresa_id").change(function(){
    var empresa_id = $(this).val();
    //console.log(empresa_id);
    $.ajax({
      url: "<%= javascripts_funcionarios_dinamicos_path %>",
      type: "POST",
      data: { 'empresa_id': empresa_id},
      beforeSend: function(){
       $('.funcionarios').html("<option>Carregando Funcionários....</option>");
      },
      success: function(data)   //here is object
      {
        $('.funcionarios').empty();
        var result = JSON.parse(data);
        $.each(result , function(k, item) {
          $('.funcionarios')
            .append($("<option></option>")
            .attr("value", item.id)
            .text(item.nome));
        });
      },